HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxMtu_bf.h
/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU2DSAIU */
#define IFX_MTU_MEMSTAT0_CPU2DSAIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU2DSAIU */
#define IFX_MTU_MEMSTAT0_CPU2DSAIU_OFF (0)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU2DTAIU */
#define IFX_MTU_MEMSTAT0_CPU2DTAIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU2DTAIU */
#define IFX_MTU_MEMSTAT0_CPU2DTAIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU2DTAIU */
#define IFX_MTU_MEMSTAT0_CPU2DTAIU_OFF (2)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU2PSAIU */
#define IFX_MTU_MEMSTAT0_CPU2PSAIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU2PSAIU */
#define IFX_MTU_MEMSTAT0_CPU2PSAIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU2PSAIU */
#define IFX_MTU_MEMSTAT0_CPU2PSAIU_OFF (3)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU2PTAIU */
#define IFX_MTU_MEMSTAT0_CPU2PTAIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU2PTAIU */
#define IFX_MTU_MEMSTAT0_CPU2PTAIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU2PTAIU */
#define IFX_MTU_MEMSTAT0_CPU2PTAIU_OFF (5)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.FSI0AIU */
#define IFX_MTU_MEMSTAT0_FSI0AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.FSI0AIU */
#define IFX_MTU_MEMSTAT0_FSI0AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.FSI0AIU */
#define IFX_MTU_MEMSTAT0_FSI0AIU_OFF (26)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.HSMCAIU */
#define IFX_MTU_MEMSTAT0_HSMCAIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.HSMCAIU */
#define IFX_MTU_MEMSTAT0_HSMCAIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.HSMCAIU */
#define IFX_MTU_MEMSTAT0_HSMCAIU_OFF (23)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.HSMRAIU */
#define IFX_MTU_MEMSTAT0_HSMRAIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.HSMRAIU */
#define IFX_MTU_MEMSTAT0_HSMRAIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.HSMRAIU */
#define IFX_MTU_MEMSTAT0_HSMRAIU_OFF (25)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.HSMTAIU */
#define IFX_MTU_MEMSTAT0_HSMTAIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.HSMTAIU */
#define IFX_MTU_MEMSTAT0_HSMTAIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.HSMTAIU */
#define IFX_MTU_MEMSTAT0_HSMTAIU_OFF (24)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU0DS2EN */
#define IFX_MTU_MEMTEST0_CPU0DS2EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU0DS2EN */
#define IFX_MTU_MEMTEST0_CPU0DS2EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU0DS2EN */
#define IFX_MTU_MEMTEST0_CPU0DS2EN_OFF (27)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU0DSEN */
#define IFX_MTU_MEMTEST0_CPU0DSEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU0DSEN */
#define IFX_MTU_MEMTEST0_CPU0DSEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU0DSEN */
#define IFX_MTU_MEMTEST0_CPU0DSEN_OFF (14)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU0DTEN */
#define IFX_MTU_MEMTEST0_CPU0DTEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU0DTEN */
#define IFX_MTU_MEMTEST0_CPU0DTEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU0DTEN */
#define IFX_MTU_MEMTEST0_CPU0DTEN_OFF (19)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU0PSEN */
#define IFX_MTU_MEMTEST0_CPU0PSEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU0PSEN */
#define IFX_MTU_MEMTEST0_CPU0PSEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU0PSEN */
#define IFX_MTU_MEMTEST0_CPU0PSEN_OFF (16)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU0PTEN */
#define IFX_MTU_MEMTEST0_CPU0PTEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU0PTEN */
#define IFX_MTU_MEMTEST0_CPU0PTEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU0PTEN */
#define IFX_MTU_MEMTEST0_CPU0PTEN_OFF (17)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU1DS2EN */
#define IFX_MTU_MEMTEST0_CPU1DS2EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU1DS2EN */
#define IFX_MTU_MEMTEST0_CPU1DS2EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU1DS2EN */
#define IFX_MTU_MEMTEST0_CPU1DS2EN_OFF (20)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU1DSEN */
#define IFX_MTU_MEMTEST0_CPU1DSEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU1DSEN */
#define IFX_MTU_MEMTEST0_CPU1DSEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU1DSEN */
#define IFX_MTU_MEMTEST0_CPU1DSEN_OFF (6)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU1DTEN */
#define IFX_MTU_MEMTEST0_CPU1DTEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU1DTEN */
#define IFX_MTU_MEMTEST0_CPU1DTEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU1DTEN */
#define IFX_MTU_MEMTEST0_CPU1DTEN_OFF (8)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU1PSEN */
#define IFX_MTU_MEMTEST0_CPU1PSEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU1PSEN */
#define IFX_MTU_MEMTEST0_CPU1PSEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU1PSEN */
#define IFX_MTU_MEMTEST0_CPU1PSEN_OFF (9)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU1PTEN */
#define IFX_MTU_MEMTEST0_CPU1PTEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU1PTEN */
#define IFX_MTU_MEMTEST0_CPU1PTEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU1PTEN */
#define IFX_MTU_MEMTEST0_CPU1PTEN_OFF (11)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU2DS2EN */
#define IFX_MTU_MEMTEST0_CPU2DS2EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU2DS2EN */
#define IFX_MTU_MEMTEST0_CPU2DS2EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU2DS2EN */
#define IFX_MTU_MEMTEST0_CPU2DS2EN_OFF (21)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU2DSEN */
#define IFX_MTU_MEMTEST0_CPU2DSEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU2DSEN */
#define IFX_MTU_MEMTEST0_CPU2DSEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU2DSEN */
#define IFX_MTU_MEMTEST0_CPU2DSEN_OFF (0)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU2DTEN */
#define IFX_MTU_MEMTEST0_CPU2DTEN_LEN (1)

